{"pages":[{"title":"八月 从头始","url":"/2017/08/07/八月-从头始/","text":"07/08: 写于清晨。 早上醒来，刷着朋友圈，看到宇菲开了一个公众号，记录她的房车生涯。惊叹中不由羡慕，似乎她一直活在她的路上，而我已经模糊成芸芸街头的一张脸谱。我不指望我有些许改变，让曾经那么多爱我、甚至仰慕于我的人说“这才是我心中的Yoyo”，我不；因为我不是定式、我也对曾经的我的毛躁、不知所谓的热情也早已不再欣赏。然而我确实需要找到，我现在的样子，归路究竟在何方？ 大抵恋爱的人都会在comfort zone待着，或者这个锅恋爱不背，只有我眷眷于舒适、不费力的环境。所以我懒了，懒到将许多的放弃当成了谦卑，懒到将不愿付出当成了无力去爱。于是在一步一步的退让后，我将自己缩到了一个角落，然后再退，再退……不知读者是否看过《套中人》，大概从我高中第一次放弃自己判断人际关系、而依赖于完美闺蜜的时候，我已经把自己放在了第一个套子里，那个套子叫做“我不擅长人际但是我真性情啊“。 于是我用很多“不能”包围了自己。不再唱《给未来的自己》。 不管怎样，怎样都会受伤，可伤了又怎样；至少我很坚强我很坦荡。 也许我努力了，到最后我仍然是不能。可是不是现在。不是什么都还没有付出的时候。不是生活中的一步步都还未和自己的模样产生共鸣的时候。 所有的目标在活出来之前都只是鸡汤而已。为无限可能加油吧。也谢谢激励我的你。:) 08/08: 写于深夜。 在所有的话开始之前，先跟自己说一句，你的时光会为你说话。你的心在哪里，你的宝藏就在哪里。 坚持健身三天，小打个卡。惊讶于曾经总是要偷懒耍滑的系列动作其实完美完成起来并不难，惊讶于我其实是喜欢自己安静地做事，安静地拉筋的模样。我想说我一切的改变是从房子开始的，又想说那个好笑的女巫童话也许不完全是骗人的。:) “女人真正想要的是什么？” … 加温回答道：“既然你说女人真正想要的是主宰自己的命运，那么就由你自己决定吧！”女巫终于热泪盈眶: “我选择白天夜晚都是美丽的女人，因为我爱你！” 今天难得的晚睡了，也是难得回家后自觉加班到此刻，就为了一篇学术博文。但成就感满满呀。那就原谅我此刻无人倾诉自发牢骚的呓言呓语吧。","tags":""},{"title":"学医偶得 一","url":"/2017/06/24/学医偶得/","text":"总纲次序 有的朋友每天要按摩很多穴位，还要刮痧、拔罐、练功，总觉得运用的方法越多，治疗的效果越好。其实并非如此，我们的气血就那么多，我们需集中力量，逐个解决身体的问题；切不可将气血分散各处，无的放矢，这样越治问题会越多，终将失去信心和耐心。记住：简单才有效，顺势才迅捷。 手法 酸和痛都表示经络尚通畅，但在该处狭窄或有拥堵，流通不畅快。酸多表示气血虚弱，需要补，不可采用过强手法。而刺痛则表明那地方有气血在，却堵住了，气血正在努力冲撞，此时则稍微用力度大的手法帮助疏通。 肺经时辰 人的气血在夜里3点到5点（也就是寅时）开始冲击肺经，所以此时若出现症状，我们通常要考虑到肺是不是有问题。曾治过一个妇女，每到冬季总是在凌晨4点钟左右躁热出汗，白天则畏寒怕冷。诊断她为风寒束表，心火内盛，典型的“冰包火”。但其发病的根源是肺气不足，无力助心火以驱散风寒，必借寅时肺经气盛才能发汗解表。所以我用补中益气汤补肺而助其宣发之力，顺势而为，一剂而愈。 功用 上可疏解肝经之郁结，中可运化脘腹之湿浊，下可补肾中之亏虚。 “诸气者，皆属于肺。”《内经》的话句句都是金玉良言，须仔细体悟才行。所以，气虚的培补、气逆的顺调、浊气的排放、清气的灌溉，都可以通过调节肺的功能来实现。 “肺主宣发肃降，肺是水上之源，肺开窍于鼻，肺主皮毛，诸气愤郁，皆属于肺，在志为忧悲，在液为涕，在体合皮毛，在窍为鼻。” 实例 少商：咽痛 治嗓子痛效果最佳，尤其是对急性咽喉肿痛有特效。 但是这个穴必须得强刺激才行，过去这些井穴（末梢的穴都叫井穴）通常都需要用三棱针来点刺，放一滴血，当时就会见效，但好多人就怕放血，这时不妨用指甲使劲掐一掐。 鱼际：心火 定喘的效果很好，只需按揉即可。夜里咳嗽，尤其是两三点钟咳嗽、睡不着觉，这种现象非常普遍，通常就是肝火引起的。这时候按摩鱼际穴就会缓解。 善于退热的要穴。当您心里有火、夜间爱咳嗽、比较烦热、睡不着觉时，按揉鱼际穴特别管用。 调节小孩的肠胃功能。在中医院小儿科，鱼际穴又叫板门穴。“板门”就是木板的房门，此穴是专门调理小孩不爱吃东西、肠胃功能不好的，一揉“板门”，胃口的门就打开了。 在大拇指下肉肚最高点。 太渊：补气、脉之会 有人总觉得气不够使，有吸不上气的感觉，就点揉太渊穴，此穴为肺经原穴，补气效果极佳。 喘气费劲（吸入氧气不够）、爬一会儿山甚至动一动就一头汗或者气不足、大便时老觉得没劲或使不上劲，这样的人就要补气。有的人是偏血虚，有的人是偏气虚。偏气虚的人要想直接补血是补不上的，一定要先补气，气足了血才能生。如果火气很旺，那就是气实，不需要直接补气。而气虚的人都是虚寒体质，都需要补气。 其为脉之会，就是体内所有脉都归它控制。心脏跳动异常、早搏、房颤，只要跟心血管有关系的，都是太渊穴的适应范围。静脉曲张、脉管炎这些跟血管、脉络有关系的病症，按揉太渊穴都有效果。 太渊穴正好在腕横纹上，很深。在揉它的时候，一定要把指甲剪平，也可以用大拇指内侧硌它。 经渠：气不顺 “经”是经络，“渠”是水渠。“经渠”的意思是经络到此就水到渠成了。经渠穴是治疗气不顺的。好多虚弱体质的人就是因为气乱了，而这个穴是一个慢慢调养的穴，它可以使肺气逐渐增强，最后达到一个水到渠成的目的。也就是说，每天都能给您补充一点点精力，而且对实证、虚证都管用。 按这个穴位的时候不要按到骨头上，而要按到骨头内侧缘。不要往下按，要往外按，搓着按就能找到这个穴了。平常可以经常揉一揉它，觉得气有点儿不太顺或者气接不上来都可以揉，而且无论是热性、寒性咳嗽都可以揉， 列缺：头颈不适 “头项寻列缺”，脖子落枕、感冒引起的头痛，都跟风寒有关，平时您可要多揉列缺穴。 孔最：扁桃体炎 “孔”是毛孔，“最”是最大。孔最穴的意思就是身体里所有跟孔有关的问题都归它来管理。上至鼻窍，下至肛门，都跟孔有关。对风寒感冒引起的咳嗽和扁桃体炎效果不错。有的人发烧不出汗，赶紧揉孔最穴可以帮助发汗。 尺泽：泻肺补肾 给肾以恩泽，给肾以浇灌，最好的补肾穴，通过降肺气而补肾，最适合上实下虚的人。肺属金，肾属水，而金能生水，就是肺气足了就可以补肾。所以，揉尺泽穴就能把肺经多余的能量补到肾经上去。尺泽穴又是合穴，属水，所以这种补肾方法叫做泻肺补肾法。其实，泻只是能量的一种转化，是把肺经多余的能量转换到肾经上去了，因为上焦的能量过多、淤积住了，反而让人觉得不舒服，老有火气，老想吃点儿凉的或者祛火的东西，而同时却两脚冰凉。这是火气都用到上边去了，没有留些到下面来，形成了上实下虚之证。 侠白：解气郁恐惧 “侠”是侠客，“白”是白色。肺属金，金在五行的颜色为白，因此，这里“白”代表肺的意思。而“侠白”就是有个侠客在保护肺，给我们补足肺气，让我们无所畏惧。所以它可以治疗肺气不足造成的经常恐惧、心跳过速。为什么人会恐惧呢？就是先有忧虑，忧虑解不开了就会恐惧。而且一忧虑就会气郁，常常气串两肋，所以按揉侠白穴还可以治疗肋间神经痛，即两肋痛。 天府：通鼻窍 鼻窍通于天，天府穴暗含着这个意思，就是能治鼻子的各种疾患。像过敏性鼻炎、慢性鼻炎、经常流鼻血等鼻子的疾病，揉天府穴效果非常好。 在腋下3寸，此穴可以用一种特殊的方法来找到。两臂张开，掌心相对平伸，在鼻尖上涂上一点墨水，用鼻尖点臂上，点到处就是此穴。 云门：浊气宣发 这里是一个气体宣发的地方。很多人爱生气，气完就憋在那里了，宣发不出去，于是循着肺经走到四肢，就会造成四肢烦热、特别燥、心里堵闷、掌心热等症状。这时，使劲点揉云门穴，一般就会打嗝，气就发出去了。打通经络，其中的一个主要目的就是排除浊气。好多人一揉这个肺经就老打嗝，这是非常好的现象。 中线任脉旁开６寸，锁骨下缘处。两手叉腰时，此处会有一个三角窝。 中府：调理中气 “中”指中气，就是脾肺之气，脾和肺合起来的气叫中气。如果经常觉得气不够使，喘不上气来，或者大便的时候无力，以及吃一点东西肚子就胀，这就是中气不足了。中府穴就是专门调治中气不足的。中府穴是肺经的一个募穴，也是脾肺两经交会的一个穴，这个穴调气最好。如果人体的气乱了，就爱咳嗽、哮喘、堵闷，会经常觉得上气不接下气，这时一定要多揉中府穴。 在云门下面一寸。推的时候，大拇指按着中府穴，然后向上推云门穴，一般这里会很痛。把痛的地方给推开，浊气就会散掉，您就会觉得胸里面非常舒服。 制约 肺功能不好就是肝里的浊气熏蒸肺造成的，主要的源头在肝，所以从肝上来调节才是治本的方法。 肺本是娇脏，最怕攻伐，所以“调诸脏即是治肺”实乃真知灼见。如咳喘症，也很少由肺经直接引起，多是其他脏波及。由肝火引起的叫“木火刑金”，祛肝火就好；由肾虚引起的叫“肾不纳气”，补肾气辄效；由脾虚引起的叫“痰湿蕴肺”，健脾祛湿最佳。还有外感咳嗽，多由风寒引起，那就赶走膀胱经之风寒好了。通常咳喘的病总会迁延不愈，古时便有“内科不治喘”之说，其实多是因见肺治肺，有痰化痰，宣来降去，不治根本，才成痼疾。 大肠经功用 肺与大肠相表里，所以肺脏上面有什么疾患，都可以通过大肠经来调理，它主治皮肤病，也管便秘、腹泻等肠道疾病。 皮肤病可以说是最让人心烦意乱的疾病了，荨麻疹、神经性皮炎、日光性皮炎、牛皮癣、疥疮、丹毒、疖肿、皮肤瘙痒症……都让人痛苦不堪。在百治无效之际，取大肠经刮痧，通常都会得到不同程度的缓解。大肠经为多气多血之经，阳气最盛，用刮痧和刺络的方法，最善祛体内热毒。若平日常常敲打，可清洁血液通道，预防青春痘。大肠经对现代医学所讲的淋巴系统有自然保护功能，经常刺激可增强人体免疫力，防止淋巴结核病的生成。 实例 三间：通经行气 最善通经行气，上可通达头面，治疗三叉神经痛、齿痛、目痛、喉肿痛和肩膀痛；下能通腹行气，泻泄可止，便秘可通。另外，有研究指出此穴有消炎、止痛、抗过敏的功效。 位于食指近拇指侧根部，第二掌指关节后。常用大拇指内侧指节横向硌揉此穴，效果甚佳。","tags":"肺经"},{"title":"暑月 新鲜事","url":"/2017/05/09/暑月-新鲜事/","text":"05/09: 在看小说、学术、和写博客之间拉扯，最终还是决定先把思绪倾倒。我着实是一个很奇怪的人，当没有朋友的时候会自怜，当交际多的时候会自厌。穿着一身22岁时候的面具，说着没长进的话语，看到自己空洞的灵魂。好……无力。所以我想多写，我问自己是谁的时候只能多写，让我的重心通过笔端泄入地平面。 人的浮躁往往来源于说的委实太多，做与思考却太少。今天早晨和万胖聊天是关于为何我不能做一个开心而高情商的宝宝，可真正的答案我想想其实也知道。这样的谈话就是浮夸。爱圣经。“我亲爱的弟兄，这是你们所知道的。但你们各人要快快地听，慢慢地说，慢慢地动怒，因为人的怒气不能成就神的义。”（雅各书1:19-20）“惟用爱心说诚实话，凡事长进，连于元首基督。“（以弗所书4:15）”不轻易发怒的，胜过勇士；治服己心的，强如取城。“（箴言16：32）我不想逃，我想定个目标。一年一年时光过去，我不信我不能长成基督的模样。今年，说话这件小事，放进祷告中。 说来，这个月的两件大事，即将毕业和商定订婚。很幸运，在今年的CMU学年中还能见证到上帝的恩典。我为雨桐祷告过，为詹婧祷告过，为我自己祷告过。不管是不是基督徒，是不是明白上帝应许祷告是一样怎样的事情，但我明白，我见证，我记住。原来我在一个群体中是一个代祷的管道，原来即便事情也许在福音的版图中无关紧要上帝也是关注的。毕竟上帝是爱，祂怜悯照顾了我们的感受。所以这份工作又是上帝给的。不确定是不是我眼中的最好，但是上帝眼中的最好，我一定能一点一点体会到。愿我继续能成为祝福的管道。 说到订婚，也有很多话要说。这两个月甜蜜流于嘴边，这样不好。何必徒徒挂在嘴边惹人艳羡，不如独自感受、刻骨铭心。很感激万胖，在长久以来对我的包容，直到我醒来，我知道，我明白他对我的包容意味着什么。从最开始说翻脸就翻脸的脾气，到后来时不时的低落，和永无止休的吃醋，我女生的情绪性的坏毛病渐渐好转，我是终于能有锚定住船。我们之间有那么多的故事，一点一滴的小瞬间，构成我爱你。未来几十年和一个人过也许是一件很可怕的事情，但如果那是和你，我想我还是很期待的。我希望你幸福，也很开心你未来的幸福有我参与。林林种种，构成一句话，余生请多多指教啦。 最后，还想诘问自己，除了自我剖析，除了谈情说爱，除了学术汇报，我的笔下还能不能有新的主题了？还是看的书太少呀。希望以后能客观点。嘤嘤嘤！ 06/09: 最近的重心一直在未来的家居设计上。想要学习家居的灵感来自于在Buffalo住的Airbnb。大大高高又舒适的床，地毯，小摆件，抱枕，壁画，甚至厕所里摆着一束小草。对我而言追求美并不是一件容易的事情，大概是因为长得丑吧（咦）。搭配家居与搭配衣服给我的感觉一样吃力。不过还是很愿意学习，为了罗尼~比心~ 看了小一周后给自己两个原则： 先确定功能再思考布局 先确定配色再挑选家居 以下是目前进展~ 首先上我的户型图图～ （图片来源：waterford landing） 由于是一个人住，这样的房型算是很均衡啦，感觉空间足够大，能够瞎发挥儿。 第一站是卧室。在仔细思索我个人生活习惯后，我决定了卧室的基础摆设： 大大大大大床 两个藤木脏衣篓 化妆柜和全身铜镜 基调是森林，绿色和木头色。决定留着那个墙壁上的小植物。一些小物，包括一台手机，一筒挂式纸巾（鼻炎患者的悲哀），一个香薰加湿器（更森林一点）就是极好。 （图片来源：h&amp;m home） 第二站是客厅。一人居……我的客厅并不需要沙发，也不需要电视。需要一台很长的桌子，一半办公，一半吃饭，显示屏在中间，吃饭的时候也可以看看电影。另一个方向，大概需要很多柜子，几个软座，一片绿意和一点留白。外加门口一个舒服得不得了的软软的座椅，可以坐着换双鞋。 （图片来源：pinterest) 第三站是dining room。既然我的客厅已经完美履行了吃饭的功能，我的dining room也许就适合做一个小小的练功房。瑜伽垫，小哑铃，几面镜子，还要想办法把ipad挂在墙上。 （图片来源：pinterest) 好啦。计划完毕！希望有足够的资金嘤嘤嘤～ 06/11: 今天……没有去主日。也很久……没有灵修了。抵不住歉意，打开了一个听道视频，说到的经文是：“你们所听的要留心。你们用什么量器量给人，也必用什么量器量给你们，并且要多给你们。因为有的，还要给他，没有的，连他所有的也要夺去。” 不敢看圣经的原因是每一句都很扎心。仔细寻思，脑海里有很多做错的事，却真的觉得需要千钧力才愿去改。小组合作的计较，与人相处的苦毒，甚至亲人之间的不饶恕，都在把我的生命往泥潭里拉。我害怕的有好多，如果我不为自己发声就要被人利用了，如果我不表明自己的立场我就要被人无视了，如果我放开心胸接纳别人我又要逼到不可能保留自己的界线了。我向上帝呼求爱的能力，上帝马上把我放进挑战的环境里。这个挑战年复一年我都fail了，现在条件反射地想用冷漠武装自己。主啊，我不靠近你，我怎么能有能力？而主啊，当我靠近你，我却看见我生命满满的瑕疵却没力气去改。我的挣扎逼着我远离，可是我时时刻刻又需要着上帝。主啊，求你拯救。 06/19: 终于知道人和人之间是独立的个体。亲缘关系也只是关系，并不妨碍独立。你有缺点，并不表示我有意见呀。 我想了很久什么是boundary。现在想来不过是过好自己。和是否take shit并无联系。哪怕爱心都是修行。 所谓的人生意义，活得出来是硬道理，活不出来只是鸡汤而已。外人说了一百遍，立不起来的还是自己，所以不妨不干涉也不说，只做最后关头的点拨。 回想自己：下的决心，睡过去的光阴，小说什么只是麻痹自己而已。当什么假正经。 ——感悟于和闺蜜及妈妈的相处。 06/24: 我们家里的人都不爱洗碗。每天中午把碗收起来午休，都偷偷摸摸地躲在房门后，一个赛一个醒得晚。谁先憋不住出来了，很好，十分钟内其他两扇门都打开。晚饭的惯例是爸爸做饭。食完晚餐，就到了每天我和妈妈的眼神对决。两个女人，今天一个皮肤病，明天一个姨妈痛。有时候爸爸哭笑不得去洗碗了，两个女人又开始用眼神互相指责，却动也不愿意动一步。 07/13: 零零星星又攒下一些思绪想写的。 我有一个好主意，如果测试两个人是否相熟，可以让一个人帮另一个人找眼镜。 大概是半个多月前回到老家。姥姥喊我上楼看一下她在天台种的花。站在门外，往通向天台的黑黑的楼梯甬道望去，似乎爷爷早年佝偻着s背一步一步往上走的身影猝不及防地在眼前浮现。不由内心大骇。也理解了姥姥即使无人相伴左右也要回老家的坚持。 看小说这么久，女生为主的小说的套路无外乎是即使我不优秀，我也有一个好情人／我非常优秀，所以我有一个好情人。而男生小说刚刚触及一两本，套路却大不相同。基本都是我资质很差，但是我特别牛逼／ 我资质很好，而且我特别牛逼。一言以蔽之，女生总是需要很多很多的爱，男生总是需要很多很多的征服感。是什么让我们这样呢？是谁限定了“诶这个太重了，让男孩子来”，或者“你是一个男孩子，居然想妈妈哭鼻子羞羞“这样的性别潜意识呢？ 雪：尽道丰年瑞，丰年事若何。长安有贫者，为瑞不宜多。by罗隐 07/29: 我的拖延症好像在搬新居的过程中痊愈了。再也不用过打折的生活了。 最近遇到的Uber司机都非常的有意思。与其说尬聊是最大的收获，不如说感谢他们让我短暂地了解他们的人生。","tags":""},{"title":"偶有所得","url":"/2017/04/10/偶有所得/","text":"遗言软件/网站如果我死了，我不希望我默默无名地死去。不希望该说出口的爱意仍被沉默吞没，不希望抱歉也只能随着骸骨而去，不希望我的葬礼上亲人好友想起和我最后对话的惋惜。我还想亲自定葬礼的形式呢。可是这个网站有一定风险- 怎么确定一个人死了呢？如果还没有死遗嘱就发了不是很尴尬吗？ air穿衣App。像Uber和Airbnb一样出借多余的“审美”。 Machine Learning Literature Review网站。摘录最新方向的ML进展，以知识树形式呈现。两个维度： 作者影响力：类似于PageRank 时间：纯粹时间线，或论文“族谱” （引用关系） 苏轼的一生网站。时间轴标明苏轼年份大事记，重大转折点标红。 年份旁鼠标移位可见诗作关键意象（NLP) 及 代表作。 中医版Keep健身类App。体质测试/五脏状况自测/舌苔图像匹配 。健身计划打卡 Prayers’ Circle教堂/小组社交App。 发布祷告事项，旁人可点Prayer。发布者可看到代祷人数。代祷人姓名不可见。上帝回应则划过，代祷人皆收到通知。按月/半年/年度统计基础数字，关键词。小组负责人可见组内关键主题汇总，及相关资料推荐。 灵修笔记圣经类App。可以引用经文、方便分类的灵修笔记 。日期/主题view 。","tags":"未来梦"},{"title":"四月 芳菲尽","url":"/2017/04/08/四月-芳菲尽/","text":"04/09: 每个月初都是最为激情澎波的时候。月末的懒怠堆积成的文字，新开一篇博文的激动，都汇成一种仪式感，所以开博文之前恨不得多洗几遍手再挺直腰。 这个月是丰收的一个季度。奇怪我的心竟然没有得到满足。又或者没什么奇怪，人不就是这样吗，就像是脖子前套上胡萝卜的蠢驴，一辈子的奔忙、从一个目标赶到下一个目标，心仍不过是空空如也，好像除了追逐本身并没有别的意义。大概所谓人性。 但是我仍然要感谢上帝。这是一个见证。在我最茫然、无助、并且压抑的时刻，一个从天而降的offer无疑把我从自我怀疑中狠狠解救出来，过了几天日日笙歌的云端日子。然而这一切并不会就从此完美结局，比较的压力仍然是在的，公司头衔、工资多少，以及方方面面的比对迟早会把人压得喘不过气。生活中各个方面总是有比较，唯一逃脱的办法就是做那个自己。正如今天听道所闻，有些事是desire，有的事是expectation。前者来自于人类的妄求，后者来自于上帝的美意。多少次我一头栽进无边欲海中就这样一秒伤了自己，又久久沉溺。 于是谈谈朋友这件事情。很幸运的学期，每个周末的狼人会是我全身上下每个细胞的击掌尖叫。所以我骨子里还是外向的，即便我总是喜欢定义自己为一张不爱社交而内向的牌，然而我确实喜欢有人可爱并且被爱的感觉。然而我却有负担的，每每聊天过后偶尔想起，想想自己说出的话浮夸，我就并不喜欢自己。就像我就算当下有感而发的朋友圈，事后我总觉得那不纯净，就要把它删掉一样。也许我是一根擎天古木，却在枝枝桠桠开出了变异的奇特的花。噢那也是我，何尝不是，只是我不想以那些花的样子被人记住——无论是美是丑——而我执着于做一棵木讷古板的大树。大概与人之间的距离，永远不要企图比与上帝的近，要么就会迷失。 还是给自己定一个计划。爱上帝，爱自己，爱邻居 ❤ 即将27岁，向expectation启程。 04/16: 想写两个濒死瞬间。也许没有那么夸张，且听我细细说来。 大概是这周二的时候，在上爵士课。也不过是平常都做的Leap，那一天也许屏息凝气的缘故，起跳落地后心脏却止不住地狂跳，似是不受控制、几近跳出胸腔。我毫无心脏病史，却在那一刻以为自己是心脏病突发：说不出话，不敢大声喘，站立不动任由思绪洗刷。奇怪的是那一刻，思绪很简单：真的……这就是我的一生了吗……才拿到offer，还未来得及赚钱，好遗憾。真的，就要去见上帝了吗……想想是否有所亏欠，心下顿时一安。若是就这样见主面也未尝不好吧。所幸缓和。 周四再上Jazz。还是相同的跳跃，仍然出现类似的体验，虽然好点。想问，真的，这么年轻就让我去了吗……是不是因为我在世上已是顶峰，爱主的，愿意为主做事的我是不是在我看不见的未来已经变成了丑恶自私的嘴脸，所以上帝让我停留在最美的年华。真的好遗憾，21岁信主，如今，带多少人归主了吗？我的双亲，我的挚爱，如今仍有懵懂不识祂。 写在这里，是因为有一个祷告。无论我将来路如何，请主管教。若我真的作恶，不尽主内忠心，求主收去我的生命。无论结局如何，我都愿意承受。 另外，我的愿望太多，愿意付出的时间却太少。到底如何制服这智障的己身啊啊啊。 04/24: 过了一个27岁的生日，从此把“我27岁”挂在嘴边。所以有点喜欢自己的坦荡荡。岁月于我大概并不是一把无情的杀猪刀 —— 我爱27岁的自己，于18岁的自己更甚。曾经的纯真如今并未完全失去，只是如今渐渐学会妥协，这并不是不美。 于是我还是需要展望一下27岁这一年是怎样的生活。大概要开始工作了，大概渐渐要考虑成家了。大概我还是不会变，爱的爱好收住，家里要有一块很大的羊绒毯子和小熊靠背，看看书，学学中医，躺在沙发上记笔记。不想再有一搭没一搭地爱着上帝，做一个愿意委身的基督徒，不要再不冷不热下去。然后做一个爱读书的人，有专业的领域。 所以大概就是这样吧，大概这样就能让自己满意。新的一岁，Yoyo加油。","tags":""},{"title":"三月 浮世绘","url":"/2017/03/21/三月-浮世绘/","text":"03/21: 之前写了满满一篇，但不知为何没有保存。想来就觉得怠惰，不想补上当时的思绪。但我的话总是那么多的，没有出口再憋半个月好为难我，还是再开一篇吧。只是我想大概Vegas的内容就不发了，一段美好却筋疲力竭的旅行多嚼两遍，怕日后回忆起的只会是未流淌于笔下的酷暑和不小心吃到的不新鲜的生蚝。多不好啊。文字的存在只是记叙那些无法用力在大脑保存下来的东西。 于是还是要从Vegas说起。有一部电影，亦或是有一句话叫闻香识女人，最近才可以体会到。前几年在上海商场一见钟情的Oh!Lola，如今已经沦为空气清新剂了。大概是过了那个年龄，就不再喜欢没有底蕴一味甜腻的香型。那日在免税店闻到一株Black Orchid,心内种了一片大草原。有时候香水这个东西也是蛮烦人的，价格高却偏偏割舍不得，喷得浓了也不见得身边都是同好不过对牛弹琴，喷得淡了又觉得拳头打在棉花上，自己闻不到呢大抵别人也闻不到，喷了一瓶自欺欺人。 但是我还是没有买。毕竟现在作为穷学生，也作为找工作焦头烂额如火如荼的穷学生，要留一下喜欢的东西励志用，“当你成功时”。 近期是我人生中第一次主动追一篇悬疑小说，《这个电影我穿过》。小说具体内容也不必提，大概好几年后我都不会忘记边看边给舍友发短信让她早点回家的害怕。大概我下次看恐怖小说是真的要猴年马月了。于是把小说和香水的事件放在一起提，体现了散文的中心思想，形散神不散，主题都是我长大了，啊哈哈哈哈。 二月时写道他乡的月亮别样圆，三月就换一句，the grass is always greener on the other side of the fence. 和教堂姐姐谈起为什么出国的原因，其中包括了宗教自由，她也和我渐渐说了美国最近在关心的一些问题。比如转性别厕所。这个话题大爆是一个妈妈在facebook上发了一个可爱女孩子的照片，副题——你忍心让这样可爱的女孩子一辈子只能上男厕所吗？于是开始了，媒体出动，明星秀出动，政治家出动，甚至电视剧出动，呼吁大家正确看待变性人。教堂姐姐还和我提到她在的学校已经有小学生变性了。我不喜欢这样的事件，很不喜欢。美国对于自由的追求已经过了头，只要是和关键字眼沾边，就会有大票的无脑支持。可是有时候，这样的自由意味着自我不接纳。多小的小孩啊，因为看了电视剧，因为看了身边有朋友变性，然后就做出了这样的大选择，抛弃自己原有的性别，一辈子。大概是我真的不能懂。我赞同对于已经变性的人的接纳，但我不赞同大肆宣扬变性尤其是儿童变性，上帝原先造我们的样子其实都是美好的，为什么不能接受呢。记得小时候我也埋怨过我黑我胖我瘦我情商不高，但渐渐学着欣赏自己，和自己玩，因为自己开心，真的是很美好的事情。可是快餐时代没有等待。 三月，不知何时桃花开？入三月的那天躺在床上想着三月桃花诗，想了半天只想到一首“人间四月芳菲尽，山寺桃花始盛开”。于是怅然。大抵在都市待久了的人心底都不再有四季的变化，所以古人换季吟诗出门吟诗喝酒吟诗，现代人只能继续“哈哈哈”和“666”。真是没意思透顶了。遇到树，不知是何树，遇到花，不欣赏什么花，网络世界把我们的脑海牢牢吸住，但回头一看空空如也。但，诚然，如果让我过原始人生活，我也绝对不干，哈哈哈哈。 吐槽有瘾。终于清空内存，专心学术去啦。 03/23: 黑人大概都是天生的演讲家。 昨晚打了一辆Uber，上车的时候是一个黑人司机，内心打了一个寒颤。典型黑人给我的印象：高，壮，放着黑人的饶舌音乐，痞痞的样子。我不知道要聊什么，甚至连how are you都不说。大概是觉察到我的害怕或者尴尬，他突然开口了，其实也没什么特别的，就抱怨了一下路上太坑坑洼洼。只是黑人说话语气就和唱歌似的，特别有韵律感，又或者他的表达方式逗极了，哈哈哈哈哈，所以我从他开口的那一瞬间就笑到我下车，中间狂喝三口水因为笑得口渴。 事后想想自己内心最初的地图炮，都想打自己一巴掌。 03/27: 昨晚玩了一场酣畅淋漓的狼人杀。也不是昨晚，大概是下午3点半到晚上10点半；也不是一场，大概是六场。 真的很喜欢这个游戏，玩了这么久终于摸到了一些边，做一个狼人小总结~ 大部分人抿人是看状态，看站队，和除非明显聊爆了的逻辑。当狼最重要的就是打一盆鸡血，该开心的时候开心，该沉重的时候沉重，心思不要太重。 一个时间不能踩(得罪)太多人。民，甚至是神发言肯定也都会有逻辑漏洞了，抓准一两个点进行煽动发言。就算无法获得场上所有人的同意，你也可以被当成愚民混过一轮，安心举票。 神的特点，责任感，或者特别强势，而且关注自己的person of interest （比如女巫和猎人全场在找要毒或带的狼，守卫在找真的预言家或神）。民的特点，认民（或首轮认神），不悍，可能踩错人，逻辑线不清晰。 变票可以，要有收益。如果变票出神了不吃毒，白天大部分精力要放在表水上，说清自己的心路历程。 03/28: 还未从斩断了尾巴的二月中醒过神来，三月又被上旬的期盼和中旬的浪漫淹没，回过神来，又是一个月要过完了。四月份，就不得不惶恐——离毕业也只剩下一个半月了，然而工作还没有着落。连万事不上心得万胖胖也急了，亲自操刀上马整理了达拉斯所有的工作发给我。身边的朋友也渐渐在问我为什么找工作进度这么落后，开始想要帮助我。我也慌过了，考虑过转码了。然而今日在此写下这一段文字，希望回首看起的时候不觉得自己太天真。我想我拥有某方面的天赋和热忱并非偶然。也许在最开始，上帝已经设定好了我未来的可能性。然而我不希望被压力和恐惧打败，就算进度慢我也想一步一个脚印最自己擅长也喜欢的事情。加油yoyo :)","tags":""},{"title":"Yoga! Yoga!","url":"/2017/03/09/Yoga/","text":"这学期报了一个Yoga班。坦白来说，不过是为了学费回本并应付罗尼先生的“要运动要出汗”的要求，但每周有三天时间能荒废一小时在无用却美好的事情上，却觉得很值。虽然大腿战战，时常力竭，但身体似乎有好转！不知道是因为难得的脑子不动肢体却动的时光；还是真的如我猜测：瑜伽是一门作用于筋与脊柱的运动。而肝主筋，肾主骨，从中医的角度，瑜伽恰恰是对身体很好的一门锻炼。 文下记载课上常用Routine。有些衔接动作搜索不到相应图片，那就略过。因博主脑容量小，常常记忆紊乱，此帖长期更新。","tags":"yoga"},{"title":"生活即诗","url":"/2017/03/09/生活即诗/","text":"突然想写一些文字，献给中华诗词大会。我突然很想问自己读古诗的时候在读什么。我喜欢流淌的文字，以及文字里流淌的意境。那意境，也许是月下柳梢头，也许是大江东去浪淘尽，我喜欢的正是诗人的眼睛，看到的世界很美。古人的生活也许很无聊。没有电视，没有手机，资讯只能是朝堂上的刀光剑影，或是街头巷尾的闲话长短。也许还不得志。也许是受尽了万般委屈，于是歌以咏志。没有动车，没有飞机。咫日可达的地方在古代也许就是半个月的颠簸。所以才有了少小离家老大回的无奈感伤，才有了劝君更尽一杯酒的离愁别绪。所以我佩服的诗人，往往把生活过程了一首诗。竹杖芒鞋，举杯邀月，哪怕是落寞都显得很美。即便是繁重的日子，上马击狂胡，下马草军书，也铿锵有力地汇成诗的韵律。我恨的是空虚。孤单了只有孤独寂寞冷，敬佩了只有666和厉害了。近不内省自身，远不仰俯天地。在我张口结舌地看着他人对答如流的时候，在我再也想不起来一个贴切的比喻描绘细腻的情感时候，我在问自己，我的心中是否还有诗，我的生活是否还是一首诗。","tags":""},{"title":"二月 众生相","url":"/2017/02/09/二月-众生相/","text":"15/02：昨天从Jenny家回来的时候，搭上一个印度姐姐的Uber。提起有一个儿子在匹大读书，提起她从来都是去寺庙但有朝一日想进教堂看看。我问她你要去教堂？她说是啊，I like God, I like every God. 16/02：朋友圈又见留学生自杀，无意间瞄到抑郁自测。很意外地每一条都中了，证据就是现今只能用消瘦而非苗条形容的身材，还有一些口不能言的后遗症。但我很感恩，上帝给我的恩典是够用的，在那段时间陪我同行，如今祂也与我同在。证据就是，在繁忙又无望的找工作季，我还觉得感恩，从心底想微笑。ps 今天走在路上雪花飘进了鼻孔里 :( :p 17/02:今天思考的主题叫“而我何去何从”。起床的时候刷Quora，刷到一题如何在谷歌面试中保持镇静。给出答案的基本都是谷歌engineer，有说，就把面试官当成日常同事正在向你寻求帮助，有说，有绝对实力碾压的时候你自然镇定。而我倾向于后者，这也终于解释了为何我这段时间忐忐忑忑以至于英语都说不好。在上学期需要努力的时候，我选择了退后，于是我没有统计基础；在我需要刷题的时候，我选择借口，于是我没有代码基础；仅仅凭着一点machine learning的知识和少得可怜的实践经验（我甚至没把握能tune CNN！），我拿什么去自信呢？是啊，这学期身体似乎好转了，估计也能如预期一般顺利毕业了，只是我观自己，不过是随便应付的一年。可我怎么办？主啊，给我智慧，给我一条路。乱入：今天在过马路的时候旁边的人一口飞痰划过身侧，吓死个人，原来美国人也不都是有素质的啊！不过是sample bias带来的“它乡月亮格外圆”，想想国外人民在陆家嘴南京西也不见得能见到随地吐痰的人啊。下午的时候仍然在想找工作的事情。诚然，一方面能做的就是珍惜当下——过去追悔莫及已经无用了，现在刷题，趁着作业好好打好基本功这是其一；二，我内心的恐惧来自于这个行业的日新月异，害怕平台不对就彻底被时代抛弃；而我既没有做research的能力，也感觉够不着大公司的门槛。突然有一个想法，做一个literature review/ knowledge share的网站：就像一棵树，所有的论文都是基于一些论文的改进及延伸。感觉会是毕业之后能持久做下去的事情呢，一定要找对合伙人! 19/02:昨天是没有故事的一天。大概是困在家里，也没有和人沟通，也没有和自己沟通，只是机械地跑程序、调程序、记录事故。但还是有点有趣的——这是我这学期以来过得最像周末的一天：逛泳衣，买春夏穿的衣服，胡思乱想。很喜欢Madewell的日常装和Sandro Paris的仙女裙。也不知道过几年点击这些链接是不是死的、我又会怎样想，但当下我刷了一通痛快的卡。突然又有一个想法，现在可以租房（airbnb）租车（uber），是不是也可以租一个网红回来帮我选衣衫。大抵是人以群分，一个nerd身边哪里有好的眼光（当然我很幸运，纵使被吐槽得要死也承蒙萱宝宝不弃）。而发现一个自卑阴郁的小蘑菇身上的闪光点，让她因为自己的美开怀大笑，也是一件很好的事吧。当然，话又说回来了，一个nerd真的需要搭配得好的衣衫吗？XDps 有人可以迷恋、想他想到半夜在床上打滚失眠是再幸福不过的事了呢 XD 24/02:补一则：前几天在路上看到一个中国女孩子正激动而快速地讲述着自己遇到的事情，而旁边，有一个明显外国人正在不停地点头。顺便说一句，用的是中文。这已经是我认识的第二个会说中文的外国人了，也许哪一天SHE唱的那句“全世界都在说中国话”会成真吧。 26/02:今天从教堂回家的路上，正谈着找工作形势艰难，收到了一条这样短信：Good morning! Ryan (my fiance) menthioned that after talking with you last week about your job search, that he would be happy to pass on your resume to his compnay. I know Pittsburgh isn’t your first choice but I wanted to let you know if you’re interested he works for a great company. The data sicentist that worked for them just left and they hire people from all over the world so he would be happy to send your resume to the chief technology officer.记录这个被善意淹没的时刻。","tags":""},{"title":"categories","url":"/categories/index.html","text":"","tags":""},{"title":"tags","url":"/tags/index.html","text":"","tags":""}]}